---
type: ExclusionFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ExclusionFilter

`Autodesk.Revit.DB.ExclusionFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExclusionFilter | 2011 | `public ExclusionFilter ( ICollection < ElementId > idsToExclude )` |
| Method | GetIdsToExclude | 2011 | `public ICollection < ElementId > GetIdsToExclude ()` |
| Method | PassesFilter | — | `` |